zhtlab/KICADKEY/subcpu/Devices/STM32L0/include/stm32l0Rcc.h
/*
 * Copyright (c) 2018 zhtlab
 *
 * Permission is hereby granted, free of charge, to any person obtaining
 * a copy of this software and associated documentation files
 * (the "Software"), to deal in the Software without restriction, including
 * without limitation the rights to use, copy, modify, merge, publish,
 * distribute, sublicense, and/or sell copies of the Software, and to permit
 * persons to whom the Software is furnished to do so, subject to
 * the following conditions:
 *
 * The above copyright notice and this permission notice shall be included
 * in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 */

#ifndef _STM32L0RCC_H_
#define _STM32L0RCC_H_

/* STM32L0x2 reference manual  DocID025941 Rev 5 */

#define RCC_CLOCK_HPRETABLE     {0, 0, 0, 0,  0, 0, 0, 0,  1, 2, 3, 4,  6, 7, 8, 9}
#define RCC_CLOCK_PPRETABLE     {0, 0, 0, 0,  1, 2, 3, 4}

typedef struct {
  __IO uint32_t         CR;             /* 0x00 */
#define RCC_CR_PLLRDY_SHIFT             25
#define RCC_CR_PLLRDY_MASK              (1 << (RCC_CR_PLLRDY_SHIFT))
#define RCC_CR_PLLON_SHIFT              24
#define RCC_CR_PLLON_MASK               (1 << (RCC_CR_PLLON_SHIFT))
#define RCC_CR_PLLON_NO                 (0 << (RCC_CR_PLLON_SHIFT))
#define RCC_CR_PLLON_YES                (1 << (RCC_CR_PLLON_SHIFT))
#define RCC_CR_RTCPRE_SHIFT             20
#define RCC_CR_RTCPRE_MASK              (3 << (RCC_CR_RTCPRE_SHIFT))
#define RCC_CR_RTCPRE_DIV2              (0 << (RCC_CR_RTCPRE_SHIFT))
#define RCC_CR_RTCPRE_DIV4              (1 << (RCC_CR_RTCPRE_SHIFT))
#define RCC_CR_RTCPRE_DIV8              (2 << (RCC_CR_RTCPRE_SHIFT))
#define RCC_CR_RTCPRE_DIV16             (3 << (RCC_CR_RTCPRE_SHIFT))
#define RCC_CR_CSSHSEON_SHIFT           19
#define RCC_CR_CSSHSEON_MASK            (1 << (RCC_CR_CSSHSEON_SHIFT))
#define RCC_CR_CSSHSEON_NO              (0 << (RCC_CR_CSSHSEON_SHIFT))
#define RCC_CR_CSSHSEON_YES             (1 << (RCC_CR_CSSHSEON_SHIFT))
#define RCC_CR_HSEBYP_SHIFT             18
#define RCC_CR_HSEBYP_MASK              (1 << (RCC_CR_HSEBYP_SHIFT))
#define RCC_CR_HSEBYP_NO                (0 << (RCC_CR_HSEBYP_SHIFT))
#define RCC_CR_HSEBYP_YES               (1 << (RCC_CR_HSEBYP_SHIFT))
#define RCC_CR_HSERDY_SHIFT             17
#define RCC_CR_HSERDY_MASK              (1 << (RCC_CR_HSERDY_SHIFT))
#define RCC_CR_HSEON_SHIFT              16
#define RCC_CR_HSEON_MASK               (1 << (RCC_CR_HSEON_SHIFT))
#define RCC_CR_HSEON_NO                 (0 << (RCC_CR_HSEON_SHIFT))
#define RCC_CR_HSEON_YES                (1 << (RCC_CR_HSEON_SHIFT))
#define RCC_CR_MSIRDY_SHIFT             9
#define RCC_CR_MSIRDY_MASK              (1 << (RCC_CR_MSIRDY_SHIFT))
#define RCC_CR_MSION_SHIFT              8
#define RCC_CR_MSION_MASK               (1 << (RCC_CR_MSION_SHIFT))
#define RCC_CR_MSION_NO                 (0 << (RCC_CR_MSION_SHIFT))
#define RCC_CR_MSION_YES                (1 << (RCC_CR_MSION_SHIFT))
#define RCC_CR_HSI16OUTEN_SHIFT         5
#define RCC_CR_HSI16OUTEN_MASK          (1 << (RCC_CR_HSI16OUTEN_SHIFT))
#define RCC_CR_HSI16OUTEN_NO            (0 << (RCC_CR_HSI16OUTEN_SHIFT))
#define RCC_CR_HSI16OUTEN_YES           (1 << (RCC_CR_HSI16OUTEN_SHIFT))
#define RCC_CR_HSI16DIVF_SHIFT          4
#define RCC_CR_HSI16DIVF_MASK           (1 << (RCC_CR_HSI16DIVF_SHIFT))
#define RCC_CR_HSI16DIVEN_SHIFT         3
#define RCC_CR_HSI16DIVEN_MASK          (1 << (RCC_CR_HSI16DIVEN_SHIFT))
#define RCC_CR_HSI16DIVEN_NO            (0 << (RCC_CR_HSI16DIVEN_SHIFT))
#define RCC_CR_HSI16DIVEN_YES           (1 << (RCC_CR_HSI16DIVEN_SHIFT))
#define RCC_CR_HSI16RDYF_SHIFT          2
#define RCC_CR_HSI16RDYF_MASK           (1 << (RCC_CR_HSI16RDYF_SHIFT))
#define RCC_CR_HSI16ERON_SHIFT          1
#define RCC_CR_HSI16ERON_MASK           (1 << (RCC_CR_HSI16ERON_SHIFT))
#define RCC_CR_HSI16ERON_NO             (0 << (RCC_CR_HSI16ERON_SHIFT))
#define RCC_CR_HSI16ERON_YES            (1 << (RCC_CR_HSI16ERON_SHIFT))
#define RCC_CR_HSI16ON_SHIFT            0
#define RCC_CR_HSI16ON_MASK             (1 << (RCC_CR_HSI16ON_SHIFT))
#define RCC_CR_HSI16ON_NO               (0 << (RCC_CR_HSI16ON_SHIFT))
#define RCC_CR_HSI16ON_YES              (1 << (RCC_CR_HSI16ON_SHIFT))

#define RCC_CR_HSIRDY_MASK              (RCC_CR_HSI16RDYF_MASK)
#define RCC_CR_HSION_YES                (RCC_CR_HSI16ON_YES)

  __IO uint32_t         ICSCR;          /* 0x04 */
#define RCC_ICSCR_MSITRIM_SHIFT         24
#define RCC_ICSCR_MSITRIM_MASK          (0x1f << (RCC_ICSCR_HSITRIM_SHIFT))
#define RCC_ICSCR_MSICAL_SHIFT          16
#define RCC_ICSCR_MSICAL_MASK           (0xff << (RCC_ICSCR_HSICAL_SHIFT))
#define RCC_ICSCR_MSIRANGE_SHIFT        13
#define RCC_ICSCR_MSIRANGE_MASK         (0x7 << (RCC_ICSCR_MSIRANGE_SHIFT))
#define RCC_ICSCR_MSIRANGE_65536HZ      (0 << (RCC_ICSCR_MSIRANGE_SHIFT))
#define RCC_ICSCR_MSIRANGE_131072HZ     (1 << (RCC_ICSCR_MSIRANGE_SHIFT))
#define RCC_ICSCR_MSIRANGE_262144HZ     (2 << (RCC_ICSCR_MSIRANGE_SHIFT))
#define RCC_ICSCR_MSIRANGE_524288HZ     (3 << (RCC_ICSCR_MSIRANGE_SHIFT))
#define RCC_ICSCR_MSIRANGE_1048KHZ      (4 << (RCC_ICSCR_MSIRANGE_SHIFT))
#define RCC_ICSCR_MSIRANGE_2097KHZ      (5 << (RCC_ICSCR_MSIRANGE_SHIFT))
#define RCC_ICSCR_MSIRANGE_4194KHZ      (6 << (RCC_ICSCR_MSIRANGE_SHIFT))
#define RCC_ICSCR_HSI16TRIM_SHIFT       8
#define RCC_ICSCR_HSI16TRIM_MASK        (0x1f << (RCC_ICSCR_HSI16TRIM_SHIFT))
#define RCC_ICSCR_HSI16CAL_SHIFT        0
#define RCC_ICSCR_HSI16CAL_MASK         (0xff << (RCC_ICSCR_HSI16CAL_SHIFT))

  __IO uint32_t         CRRCR;          /* 0x08 */
#define RCC_CRRCR_HSI48CAL_SHIFT        8
#define RCC_CRRCR_HSI48CAL_MASK         (0xff << (RCC_CRRCR_HSI48CAL_SHIFT))
#define RCC_CRRCR_HSI48DIV6EN_SHIFT     2
#define RCC_CRRCR_HSI48DIV6EN_MASK      (1 << (RCC_CRRCR_HSI48DIV6EN_SHIFT))
#define RCC_CRRCR_HSI48DIV6EN_NO        (0 << (RCC_CRRCR_HSI48DIV6EN_SHIFT))
#define RCC_CRRCR_HSI48DIV6EN_YES       (1 << (RCC_CRRCR_HSI48DIV6EN_SHIFT))
#define RCC_CRRCR_HSI48RDY_SHIFT        1
#define RCC_CRRCR_HSI48RDY_MASK         (1 << (RCC_CRRCR_HSI48RDY_SHIFT))
#define RCC_CRRCR_HSI48RDY_NO           (0 << (RCC_CRRCR_HSI48RDY_SHIFT))
#define RCC_CRRCR_HSI48RDY_YES          (1 << (RCC_CRRCR_HSI48RDY_SHIFT))
#define RCC_CRRCR_HSI48ON_SHIFT         0
#define RCC_CRRCR_HSI48ON_MASK          (1 << (RCC_CRRCR_HSI48ON_SHIFT))
#define RCC_CRRCR_HSI48ON_NO            (0 << (RCC_CRRCR_HSI48ON_SHIFT))
#define RCC_CRRCR_HSI48ON_YES           (1 << (RCC_CRRCR_HSI48ON_SHIFT))


