zhtlab/KICADKEY/subcpu/Devices/STM32L0/include/stm32l0Rcc.h
  __IO uint32_t         CFGR;           /* 0x0c */
#define RCC_CFGR_MCOPRE_SHIFT           28
#define RCC_CFGR_MCOPRE_MASK            (7 << (RCC_CFGR_MCOPRE_SHIFT))
#define RCC_CFGR_MCOPRE_DIV1            (0 << (RCC_CFGR_MCOPRE_SHIFT))
#define RCC_CFGR_MCOPRE_DIV2            (1 << (RCC_CFGR_MCOPRE_SHIFT))
#define RCC_CFGR_MCOPRE_DIV4            (2 << (RCC_CFGR_MCOPRE_SHIFT))
#define RCC_CFGR_MCOPRE_DIV7            (3 << (RCC_CFGR_MCOPRE_SHIFT))
#define RCC_CFGR_MCOPRE_DIV16           (4 << (RCC_CFGR_MCOPRE_SHIFT))
#define RCC_CFGR_MCOSEL_SHIFT           24
#define RCC_CFGR_MCOSEL_MASK            (0xf << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_MCOSEL_DISABLE         (0 << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_MCOSEL_SYSCLK          (1 << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_MCOSEL_HSI16           (2 << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_MCOSEL_MSI             (3 << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_MCOSEL_HSE             (4 << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_MCOSEL_MAINPLL         (5 << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_MCOSEL_LSI             (6 << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_MCOSEL_HSI48           (8 << (RCC_CFGR_MCOSEL_SHIFT))
#define RCC_CFGR_PLLDIV_SHIFT           22
#define RCC_CFGR_PLLDIV_MASK            (3 << (RCC_CFGR_PLLDIV_SHIFT))
#define RCC_CFGR_PLLDIV_DIV(x)          (((x)-1) << (RCC_CFGR_PLLDIV_SHIFT))
#define RCC_CFGR_PLLDIV_RESERVED0       (0 << (RCC_CFGR_PLLDIV_SHIFT))
#define RCC_CFGR_PLLDIV_INVALID0        (0 << (RCC_CFGR_PLLDIV_SHIFT))
#define RCC_CFGR_PLLDIV_DIV2            (1 << (RCC_CFGR_PLLDIV_SHIFT))
#define RCC_CFGR_PLLDIV_DIV3            (2 << (RCC_CFGR_PLLDIV_SHIFT))
#define RCC_CFGR_PLLDIV_DIV4            (3 << (RCC_CFGR_PLLDIV_SHIFT))
#define RCC_CFGR_PLLMUL_SHIFT           18
#define RCC_CFGR_PLLMUL_MASK            (0xf << (RCC_CFGR_PLLMUL_SHIFT))
#define RCC_CFGR_PLLMUL_X3              (0 << (RCC_CFGR_PLLMUL_SHIFT))
#define RCC_CFGR_PLLMUL_X4              (1 << (RCC_CFGR_PLLMUL_SHIFT))
#define RCC_CFGR_PLLMUL_X6              (2 << (RCC_CFGR_PLLMUL_SHIFT))
#define RCC_CFGR_PLLMUL_X8              (3 << (RCC_CFGR_PLLMUL_SHIFT))
#define RCC_CFGR_PLLMUL_X12             (4 << (RCC_CFGR_PLLMUL_SHIFT))
#define RCC_CFGR_PLLMUL_X16             (5 << (RCC_CFGR_PLLMUL_SHIFT))
#define RCC_CFGR_PLLMUL_X24             (6 << (RCC_CFGR_PLLMUL_SHIFT))
#define RCC_CFGR_PLLMUL_X32             (7 << (RCC_CFGR_PLLMUL_SHIFT))
#define RCC_CFGR_PLLMUL_X48             (8 << (RCC_CFGR_PLLMUL_SHIFT))
#define RCC_CFGR_PLLSRC_SHIFT           16
#define RCC_CFGR_PLLSRC_MASK            (1 << (RCC_CFGR_PLLSRC_SHIFT))
#define RCC_CFGR_PLLSRC_HSI16           (0 << (RCC_CFGR_PLLSRC_SHIFT))
#define RCC_CFGR_PLLSRC_HSE             (1 << (RCC_CFGR_PLLSRC_SHIFT))
#define RCC_CFGR_STOPWUCK_SHIFT         15
#define RCC_CFGR_STOPWUCK_MASK          (1 << (RCC_CFGR_STOPWUCK_SHIFT))
#define RCC_CFGR_STOPWUCK_NO            (0 << (RCC_CFGR_STOPWUCK_SHIFT))
#define RCC_CFGR_STOPWUCK_YES           (1 << (RCC_CFGR_STOPWUCK_SHIFT))
#define RCC_CFGR_PPRE2_SHIFT		11		/* APB2 */
#define RCC_CFGR_PPRE2_MASK		(7 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE2_DIV1		(0 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE2_DIV2		(4 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE2_DIV4		(5 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE2_DIV8		(6 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE2_DIV16		(7 << (RCC_CFGR_PPRE2_SHIFT))
#define RCC_CFGR_PPRE1_SHIFT		8		/* APB1 */
#define RCC_CFGR_PPRE1_MASK		(7 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_PPRE1_DIV1		(0 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_PPRE1_DIV2		(4 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_PPRE1_DIV4		(5 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_PPRE1_DIV8		(6 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_PPRE1_DIV16		(7 << (RCC_CFGR_PPRE1_SHIFT))
#define RCC_CFGR_HPRE_SHIFT             4               /* AHB */
#define RCC_CFGR_HPRE_MASK		(0xf << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV1		(0 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV2		(8 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV4		(9 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV8		(10 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV16             (11 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV64             (12 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV128            (13 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV256            (14 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_HPRE_DIV512            (15 << (RCC_CFGR_HPRE_SHIFT))
#define RCC_CFGR_SWS_SHIFT              2
#define RCC_CFGR_SWS_MASK               (3 << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SWS_MSI                (0 << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SWS_HSI16              (1 << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SWS_HSE                (2 << (RCC_CFGR_SWS_SHIFT))
#define RCC_CFGR_SWS_PLL                (3 << (RCC_CFGR_SWS_SHIFT))
#define         RCC_CFGR_SWS_HSI        (RCC_CFGR_SWS_HSI16)
#define RCC_CFGR_SW_SHIFT               0
#define RCC_CFGR_SW_MASK                (3 << (RCC_CFGR_SW_SHIFT))
#define RCC_CFGR_SW_MSI                 (0 << (RCC_CFGR_SW_SHIFT))
#define RCC_CFGR_SW_HSI16               (1 << (RCC_CFGR_SW_SHIFT))
#define         RCC_CFGR_SW_HSI         (RCC_CFGR_SW_HSI16)
#define RCC_CFGR_SW_HSE                 (2 << (RCC_CFGR_SW_SHIFT))
#define RCC_CFGR_SW_PLL                 (3 << (RCC_CFGR_SW_SHIFT))

  __IO uint32_t         CIER;           /* 0x10 */
#define RCC_CIER_CSSLSEIE_SHIFT         7
#define RCC_CIER_CSSLSEIE_MASK		(1 << (RCC_CIER_CSSLSEIE_SHIFT))
#define RCC_CIER_CSSLSEIE_NO		(0 << (RCC_CIER_CSSLSEIE_SHIFT))
#define RCC_CIER_CSSLSEIE_YES		(1 << (RCC_CIER_CSSLSEIE_SHIFT))
#define RCC_CIER_HSI48_RDYIE_SHIFT      6
#define RCC_CIER_HSI48_RDYIE_MASK	(1 << (RCC_CIER_HSI48_RDYIE_SHIFT))
#define RCC_CIER_HSI48_RDYIE_NO		(0 << (RCC_CIER_HSI48_RDYIE_SHIFT))
#define RCC_CIER_HSI48_RDYIE_YES	(1 << (RCC_CIER_HSI48_RDYIE_SHIFT))
#define RCC_CIER_MSI_RDYIE_SHIFT	5
#define RCC_CIER_MSI_RDYIE_MASK		(1 << (RCC_CIER_MSI_RDYIE_SHIFT))
#define RCC_CIER_MSI_RDYIE_NO		(0 << (RCC_CIER_MSI_RDYIE_SHIFT))
#define RCC_CIER_MSI_RDYIE_YES		(1 << (RCC_CIER_MSI_RDYIE_SHIFT))
#define RCC_CIER_PLL_RDYIE_SHIFT	4
#define RCC_CIER_PLL_RDYIE_MASK		(1 << (RCC_CIER_PLL_RDYIE_SHIFT))
#define RCC_CIER_PLL_RDYIE_NO		(0 << (RCC_CIER_PLL_RDYIE_SHIFT))
#define RCC_CIER_PLL_RDYIE_YES		(1 << (RCC_CIER_PLL_RDYIE_SHIFT))
#define RCC_CIER_HSE_RDYIE_SHIFT        3
#define RCC_CIER_HSE_RDYIE_MASK         (1 << (RCC_CIER_HSE_RDYIE_SHIFT))
#define RCC_CIER_HSE_RDYIE_NO           (0 << (RCC_CIER_HSE_RDYIE_SHIFT))
#define RCC_CIER_HSE_RDYIE_YES          (1 << (RCC_CIER_HSE_RDYIE_SHIFT))
#define RCC_CIER_HSI16_RDYIE_SHIFT      2
#define RCC_CIER_HSI16_RDYIE_MASK       (1 << (RCC_CIER_HSI16_RDYIE_SHIFT))
#define RCC_CIER_HSI16_RDYIE_NO         (0 << (RCC_CIER_HSI16_RDYIE_SHIFT))
#define RCC_CIER_HSI16_RDYIE_YES        (1 << (RCC_CIER_HSI16_RDYIE_SHIFT))
#define RCC_CIER_LSE_RDYIE_SHIFT	1
#define RCC_CIER_LSE_RDYIE_MASK		(1 << (RCC_CIER_LSE_RDYIE_SHIFT))
#define RCC_CIER_LSE_RDYIE_NO		(0 << (RCC_CIER_LSE_RDYIE_SHIFT))
#define RCC_CIER_LSE_RDYIE_YES		(1 << (RCC_CIER_LSE_RDYIE_SHIFT))
#define RCC_CIER_LSI_RDYIE_SHIFT	0
#define RCC_CIER_LSI_RDYIE_MASK		(1 << (RCC_CIER_LSI_RDYIE_SHIFT))
#define RCC_CIER_LSI_RDYIE_NO		(0 << (RCC_CIER_LSI_RDYIE_SHIFT))
#define RCC_CIER_LSI_RDYIE_YES		(1 << (RCC_CIER_LSI_RDYIE_SHIFT))

  __IO uint32_t         CIFR;           /* 0x14 */
#define RCC_CIFR_CSSHSEF_SHIFT          8
#define RCC_CIFR_CSSHSEF_MASK           (1 << (RCC_CIFR_CSSHSEF_SHIFT))
#define RCC_CIFR_CSSLSEF_SHIFT          7
#define RCC_CIFR_CSSLSEF_MASK           (1 << (RCC_CIFR_CSSLSEF_SHIFT))
#define RCC_CIFR_HSI48_RDYF_SHIFT       6
#define RCC_CIFR_HSI48_RDYF_MASK        (1 << (RCC_CIFR_HSI48_RDYF_SHIFT))
#define RCC_CIFR_MSI_RDYF_SHIFT         5
#define RCC_CIFR_MSI_RDYF_MASK          (1 << (RCC_CIFR_MSI_RDYF_SHIFT))
#define RCC_CIFR_PLL_RDYF_SHIFT         4
#define RCC_CIFR_PLL_RDYF_MASK          (1 << (RCC_CIFR_PLL_RDYF_SHIFT))
#define RCC_CIFR_HSE_RDYF_SHIFT         3
#define RCC_CIFR_HSE_RDYF_MASK          (1 << (RCC_CIFR_HSE_RDYF_SHIFT))
#define RCC_CIFR_HSI_RDYF_SHIFT         2
#define RCC_CIFR_HSI_RDYF_MASK          (1 << (RCC_CIFR_HSI_RDYF_SHIFT))
#define RCC_CIFR_LSE_RDYF_SHIFT         1
#define RCC_CIFR_LSE_RDYF_MASK          (1 << (RCC_CIFR_LSE_RDYF_SHIFT))
#define RCC_CIFR_LSI_RDYF_SHIFT         0
#define RCC_CIFR_LSI_RDYF_MASK          (1 << (RCC_CIFR_LSI_RDYF_SHIFT))

  __IO uint32_t         CICR;           /* 0x18 */
#define RCC_CICR_CSSHSEC_SHIFT          8
#define RCC_CICR_CSSHSEC_MASK           (1 << (RCC_CICR_CSSHSEC_SHIFT))
#define RCC_CICR_CSSLSEC_SHIFT          7
#define RCC_CICR_CSSLSEC_MASK           (1 << (RCC_CICR_CSSLSEC_SHIFT))
#define RCC_CICR_HSI48_RDYC_SHIFT       6
#define RCC_CICR_HSI48_RDYC_MASK        (1 << (RCC_CICR_HSI48_RDYC_SHIFT))
#define RCC_CICR_MSI_RDYC_SHIFT         5
#define RCC_CICR_MSI_RDYC_MASK          (1 << (RCC_CICR_MSI_RDYC_SHIFT))
#define RCC_CICR_PLL_RDYC_SHIFT         4
#define RCC_CICR_PLL_RDYC_MASK          (1 << (RCC_CICR_PLL_RDYC_SHIFT))
#define RCC_CICR_HSE_RDYC_SHIFT         3
#define RCC_CICR_HSE_RDYC_MASK          (1 << (RCC_CICR_HSE_RDYC_SHIFT))
#define RCC_CICR_HSI_RDYC_SHIFT         2
#define RCC_CICR_HSI_RDYC_MASK          (1 << (RCC_CICR_HSI_RDYC_SHIFT))
#define RCC_CICR_LSE_RDYC_SHIFT         1
#define RCC_CICR_LSE_RDYC_MASK          (1 << (RCC_CICR_LSE_RDYC_SHIFT))
#define RCC_CICR_LSI_RDYC_SHIFT         0
#define RCC_CICR_LSI_RDYC_MASK          (1 << (RCC_CICR_LSI_RDYC_SHIFT))

