zhtlab/KICADKEY/subcpu/Devices/STM32L0/include/stm32l0Rcc.h
  __IO uint32_t         IOPRSTR;        /* 0x1c */

  __IO uint32_t         AHBRSTR;        /* 0x20 */
#define RCC_AHBRSTR_MIFRST_SHIFT        8
#define RCC_AHBRSTR_MIFRST_MASK         (1 << (RCC_AHBRSTR_MIFRST_SHIFT))
#define RCC_AHBRSTR_MIFRST_NO           (0 << (RCC_AHBRSTR_MIFRST_SHIFT))
#define RCC_AHBRSTR_MIFRST_YES          (1 << (RCC_AHBRSTR_MIFRST_SHIFT))
#define RCC_AHBRSTR_DMARST_SHIFT        0
#define RCC_AHBRSTR_DMARST_MASK         (1 << (RCC_AHBRSTR_DMARST_SHIFT))
#define RCC_AHBRSTR_DMARST_NO           (0 << (RCC_AHBRSTR_DMARST_SHIFT))
#define RCC_AHBRSTR_DMARST_YES          (1 << (RCC_AHBRSTR_DMARST_SHIFT))

  __IO uint32_t         APB2RSTR;       /* 0x24 */
#define RCC_APB2RSTR_USART1RSTR_SHIFT   14
#define RCC_APB2RSTR_USART1RSTR_MASK    (1 << (RCC_APB2RSTR_USART1RSTR_SHIFT))
#define RCC_APB2RSTR_USART1RSTR_NO      (0 << (RCC_APB2RSTR_USART1RSTR_SHIFT))
#define RCC_APB2RSTR_USART1RSTR_YES     (1 << (RCC_APB2RSTR_USART1RSTR_SHIFT))
#define RCC_APB2RSTR_SPI1RSTR_SHIFT     12
#define RCC_APB2RSTR_SPI1RSTR_MASK      (1 << (RCC_APB2RSTR_SPI1RSTR_SHIFT))
#define RCC_APB2RSTR_SPI1RSTR_NO        (0 << (RCC_APB2RSTR_SPI1RSTR_SHIFT))
#define RCC_APB2RSTR_SPI1RSTR_YES       (1 << (RCC_APB2RSTR_SPI1RSTR_SHIFT))
#define RCC_APB2RSTR_TIM22RSTR_SHIFT    5
#define RCC_APB2RSTR_TIM22RSTR_MASK     (1 << (RCC_APB2RSTR_TIM22RSTR_SHIFT))
#define RCC_APB2RSTR_TIM22RSTR_NO       (0 << (RCC_APB2RSTR_TIM22RSTR_SHIFT))
#define RCC_APB2RSTR_TIM22RSTR_YES      (1 << (RCC_APB2RSTR_TIM22RSTR_SHIFT))
#define RCC_APB2RSTR_TIM21RSTR_SHIFT    2
#define RCC_APB2RSTR_TIM21RSTR_MASK     (1 << (RCC_APB2RSTR_TIM21RSTR_SHIFT))
#define RCC_APB2RSTR_TIM21RSTR_NO       (0 << (RCC_APB2RSTR_TIM21RSTR_SHIFT))
#define RCC_APB2RSTR_TIM21RSTR_YES      (1 << (RCC_APB2RSTR_TIM21RSTR_SHIFT))
#define RCC_APB2RSTR_SYSCFGRSTR_SHIFT   0
#define RCC_APB2RSTR_SYSCFGRSTR_MASK    (1 << (RCC_APB2RSTR_SYSCFGRSTR_SHIFT))
#define RCC_APB2RSTR_SYSCFGRSTR_NO      (0 << (RCC_APB2RSTR_SYSCFGRSTR_SHIFT))
#define RCC_APB2RSTR_SYSCFGRSTR_YES     (1 << (RCC_APB2RSTR_SYSCFGRSTR_SHIFT))

  __IO uint32_t         APB1RSTR;       /* 0x28 */
#define RCC_APB1RSTR_CRSRST_SHIFT       27
#define RCC_APB1RSTR_CRSRST_MASK        (1 << (RCC_APB1RSTR_CRSRST_SHIFT))
#define RCC_APB1RSTR_CRSRST_NO          (0 << (RCC_APB1RSTR_CRSRST_SHIFT))
#define RCC_APB1RSTR_CRSRST_YES         (1 << (RCC_APB1RSTR_CRSRST_SHIFT))

  __IO uint32_t         IOPENR;         /* 0x2c */
#define RCC_IOPENR_IOPHEN_SHIFT         7
#define RCC_IOPENR_IOPHEN_MASK          (1 << (RCC_IOPENR_IOPHEN_SHIFT))
#define RCC_IOPENR_IOPHEN_NO            (0 << (RCC_IOPENR_IOPHEN_SHIFT))
#define RCC_IOPENR_IOPHEN_YES           (1 << (RCC_IOPENR_IOPHEN_SHIFT))
#define RCC_IOPENR_IOPEEN_SHIFT         4
#define RCC_IOPENR_IOPEEN_MASK          (1 << (RCC_IOPENR_IOPEEN_SHIFT))
#define RCC_IOPENR_IOPEEN_NO            (0 << (RCC_IOPENR_IOPEEN_SHIFT))
#define RCC_IOPENR_IOPEEN_YES           (1 << (RCC_IOPENR_IOPEEN_SHIFT))
#define RCC_IOPENR_IOPDEN_SHIFT         3
#define RCC_IOPENR_IOPDEN_MASK          (1 << (RCC_IOPENR_IOPDEN_SHIFT))
#define RCC_IOPENR_IOPDEN_NO            (0 << (RCC_IOPENR_IOPDEN_SHIFT))
#define RCC_IOPENR_IOPDEN_YES           (1 << (RCC_IOPENR_IOPDEN_SHIFT))
#define RCC_IOPENR_IOPCEN_SHIFT         2
#define RCC_IOPENR_IOPCEN_MASK          (1 << (RCC_IOPENR_IOPCEN_SHIFT))
#define RCC_IOPENR_IOPCEN_NO            (0 << (RCC_IOPENR_IOPCEN_SHIFT))
#define RCC_IOPENR_IOPCEN_YES           (1 << (RCC_IOPENR_IOPCEN_SHIFT))
#define RCC_IOPENR_IOPBEN_SHIFT         1
#define RCC_IOPENR_IOPBEN_MASK          (1 << (RCC_IOPENR_IOPBEN_SHIFT))
#define RCC_IOPENR_IOPBEN_NO            (0 << (RCC_IOPENR_IOPBEN_SHIFT))
#define RCC_IOPENR_IOPBEN_YES           (1 << (RCC_IOPENR_IOPBEN_SHIFT))
#define RCC_IOPENR_IOPAEN_SHIFT         0
#define RCC_IOPENR_IOPAEN_MASK          (1 << (RCC_IOPENR_IOPAEN_SHIFT))
#define RCC_IOPENR_IOPAEN_NO            (0 << (RCC_IOPENR_IOPAEN_SHIFT))
#define RCC_IOPENR_IOPAEN_YES           (1 << (RCC_IOPENR_IOPAEN_SHIFT))

#define RCC_GPIOAEN_YES                 (RCC_IOPENR_IOPAEN_YES)
#define RCC_GPIOBEN_YES                 (RCC_IOPENR_IOPBEN_YES)
#define RCC_GPIOCEN_YES                 (RCC_IOPENR_IOPCEN_YES)
#define RCC_GPIODEN_YES                 (RCC_IOPENR_IOPDEN_YES)
#define RCC_GPIOEEN_YES                 (RCC_IOPENR_IOPEEN_YES)
#define RCC_GPIOHEN_YES                 (RCC_IOPENR_IOPHEN_YES)

  __IO uint32_t         AHB1ENR;        /* 0x30 */
#define RCC_AHB1ENR_TSCEN_SHIFT		16
#define RCC_AHB1ENR_TSCEN_MASK		(1 << (RCC_AHB1ENR_TSCEN_SHIFT))
#define RCC_AHB1ENR_TSCEN_NO		(0 << (RCC_AHB1ENR_TSCEN_SHIFT))
#define RCC_AHB1ENR_TSCEN_YES		(1 << (RCC_AHB1ENR_TSCEN_SHIFT))
#define RCC_AHB1ENR_CRCEN_SHIFT		12
#define RCC_AHB1ENR_CRCEN_MASK		(1 << (RCC_AHB1ENR_CRCEN_SHIFT))
#define RCC_AHB1ENR_CRCEN_NO		(0 << (RCC_AHB1ENR_CRCEN_SHIFT))
#define RCC_AHB1ENR_CRCEN_YES		(1 << (RCC_AHB1ENR_CRCEN_SHIFT))
#define RCC_AHB1ENR_MIFEN_SHIFT         8
#define RCC_AHB1ENR_MIFEN_MASK          (1 << (RCC_AHB1ENR_MIFEN_SHIFT))
#define RCC_AHB1ENR_MIFEN_NO            (0 << (RCC_AHB1ENR_MIFEN_SHIFT))
#define RCC_AHB1ENR_MIFEN_YES           (1 << (RCC_AHB1ENR_MIFEN_SHIFT))
#define RCC_AHB1ENR_FLASHEN_SHIFT       (RCC_AHB1ENR_MIFEN_SHIFT)
#define RCC_AHB1ENR_FLASHEN_MASK        (RCC_AHB1ENR_MIFEN_MASK)
#define RCC_AHB1ENR_FLASHEN_NO          (RCC_AHB1ENR_MIFEN_NO)
#define RCC_AHB1ENR_FLASHEN_YES         (RCC_AHB1ENR_MIFEN_YES)
#define RCC_AHB1ENR_DMA1EN_SHIFT        0
#define RCC_AHB1ENR_DMA1EN_MASK         (1 << (RCC_AHB1ENR_DMA1EN_SHIFT))
#define RCC_AHB1ENR_DMA1EN_NO           (0 << (RCC_AHB1ENR_DMA1EN_SHIFT))
#define RCC_AHB1ENR_DMA1EN_YES          (1 << (RCC_AHB1ENR_DMA1EN_SHIFT))

  __IO uint32_t         APB2ENR;        /* 0x34 */
#define RCC_APB2ENR_USART1EN_SHIFT	14
#define RCC_APB2ENR_USART1EN_MASK	(1 << (RCC_APB2ENR_USART1EN_SHIFT))
#define RCC_APB2ENR_USART1EN_NO		(0 << (RCC_APB2ENR_USART1EN_SHIFT))
#define RCC_APB2ENR_USART1EN_YES	(1 << (RCC_APB2ENR_USART1EN_SHIFT))
#define RCC_APB2ENR_SPI1EN_SHIFT	12
#define RCC_APB2ENR_SPI1EN_MASK		(1 << (RCC_APB2ENR_SPI1EN_SHIFT))
#define RCC_APB2ENR_SPI1EN_NO		(0 << (RCC_APB2ENR_SPI1EN_SHIFT))
#define RCC_APB2ENR_SPI1EN_YES		(1 << (RCC_APB2ENR_SPI1EN_SHIFT))
#define RCC_APB2ENR_FWEN_SHIFT		7
#define RCC_APB2ENR_FWEN_MASK		(1 << (RCC_APB2ENR_FWEN_SHIFT))
#define RCC_APB2ENR_FWEN_NO		(0 << (RCC_APB2ENR_FWEN_SHIFT))
#define RCC_APB2ENR_FWEN_YES		(1 << (RCC_APB2ENR_FWEN_SHIFT))
#define RCC_APB2ENR_TIM22EN_SHIFT	5
#define RCC_APB2ENR_TIM22EN_MASK	(1 << (RCC_APB2ENR_TIM22EN_SHIFT))
#define RCC_APB2ENR_TIM22EN_NO		(0 << (RCC_APB2ENR_TIM22EN_SHIFT))
#define RCC_APB2ENR_TIM22EN_YES		(1 << (RCC_APB2ENR_TIM22EN_SHIFT))
#define RCC_APB2ENR_TIM21EN_SHIFT	2
#define RCC_APB2ENR_TIM21EN_MASK	(1 << (RCC_APB2ENR_TIM21EN_SHIFT))
#define RCC_APB2ENR_TIM21EN_NO		(0 << (RCC_APB2ENR_TIM21EN_SHIFT))
#define RCC_APB2ENR_TIM21EN_YES		(1 << (RCC_APB2ENR_TIM21EN_SHIFT))
#define RCC_APB2ENR_SYSCFGEN_SHIFT	0
#define RCC_APB2ENR_SYSCFGEN_MASK	(1 << (RCC_APB2ENR_SYSCFGEN_SHIFT))
#define RCC_APB2ENR_SYSCFGEN_NO		(0 << (RCC_APB2ENR_SYSCFGEN_SHIFT))
#define RCC_APB2ENR_SYSCFGEN_YES	(1 << (RCC_APB2ENR_SYSCFGEN_SHIFT))

  __IO uint32_t         APB1ENR;       /* 0x38 */
#define RCC_APB1ENR_LPTIM1EN_SHIFT      31
#define RCC_APB1ENR_LPTIM1EN_MASK       (1 << (RCC_APB1ENR_LPTIM1EN_SHIFT))
#define RCC_APB1ENR_LPTIM1EN_NO         (0 << (RCC_APB1ENR_LPTIM1EN_SHIFT))
#define RCC_APB1ENR_LPTIM1EN_YES        (1 << (RCC_APB1ENR_LPTIM1EN_SHIFT))
#define RCC_APB1ENR_I2C3EN_SHIFT        30
#define RCC_APB1ENR_I2C3EN_MASK         (1 << (RCC_APB1ENR_I2C3EN_SHIFT))
#define RCC_APB1ENR_I2C3EN_NO		(0 << (RCC_APB1ENR_I2C3EN_SHIFT))
#define RCC_APB1ENR_I2C3EN_YES		(1 << (RCC_APB1ENR_I2C3EN_SHIFT))
#define RCC_APB1ENR_DAC1EN_SHIFT	29
#define RCC_APB1ENR_DAC1EN_MASK         (1 << (RCC_APB1ENR_DAC1EN_SHIFT))
#define RCC_APB1ENR_DAC1EN_NO		(0 << (RCC_APB1ENR_DAC1EN_SHIFT))
#define RCC_APB1ENR_DAC1EN_YES 		(1 << (RCC_APB1ENR_DAC1EN_SHIFT))
#define RCC_APB1ENR_PWREN_SHIFT         28
#define RCC_APB1ENR_PWREN_MASK          (1 << (RCC_APB1ENR_PWREN_SHIFT))
#define RCC_APB1ENR_PWREN_NO            (0 << (RCC_APB1ENR_PWREN_SHIFT))
#define RCC_APB1ENR_PWREN_YES           (1 << (RCC_APB1ENR_PWREN_SHIFT))
#define RCC_APB1ENR_CRSEN_SHIFT         27
#define RCC_APB1ENR_CRSEN_MASK          (1 << (RCC_APB1ENR_CRSEN_SHIFT))
#define RCC_APB1ENR_CRSEN_NO            (0 << (RCC_APB1ENR_CRSEN_SHIFT))
#define RCC_APB1ENR_CRSEN_YES           (1 << (RCC_APB1ENR_CRSEN_SHIFT))
#define RCC_APB1ENR_USBEN_SHIFT         23
#define RCC_APB1ENR_USBEN_MASK          (1 << (RCC_APB1ENR_USBEN_SHIFT))
#define RCC_APB1ENR_USBEN_NO            (0 << (RCC_APB1ENR_USBEN_SHIFT))
#define RCC_APB1ENR_USBEN_YES           (1 << (RCC_APB1ENR_USBEN_SHIFT))
#define       RCC_APB1ENR_USBFSEN_NO      (RCC_APB1ENR_USBEN_NO)
#define       RCC_APB1ENR_USBFSEN_YES     (RCC_APB1ENR_USBEN_YES)
#define RCC_APB1ENR_I2C2EN_SHIFT	22
#define RCC_APB1ENR_I2C2EN_MASK         (1 << (RCC_APB1ENR_I2C2EN_SHIFT))
#define RCC_APB1ENR_I2C2EN_NO		(0 << (RCC_APB1ENR_I2C2EN_SHIFT))
#define RCC_APB1ENR_I2C2EN_YES		(1 << (RCC_APB1ENR_I2C2EN_SHIFT))
#define RCC_APB1ENR_I2C1EN_SHIFT	21
#define RCC_APB1ENR_I2C1EN_MASK         (1 << (RCC_APB1ENR_I2C1EN_SHIFT))
#define RCC_APB1ENR_I2C1EN_NO		(0 << (RCC_APB1ENR_I2C1EN_SHIFT))
#define RCC_APB1ENR_I2C1EN_YES		(1 << (RCC_APB1ENR_I2C1EN_SHIFT))
#define RCC_APB1ENR_USART5EN_SHIFT	20
#define RCC_APB1ENR_USART5EN_MASK	(1 << (RCC_APB1ENR_USART5EN_SHIFT))
#define RCC_APB1ENR_USART5EN_NO         (0 << (RCC_APB1ENR_USART5EN_SHIFT))
#define RCC_APB1ENR_USART5EN_YES	(1 << (RCC_APB1ENR_USART5EN_SHIFT))
#define RCC_APB1ENR_USART4EN_SHIFT	19
#define RCC_APB1ENR_USART4EN_MASK	(1 << (RCC_APB1ENR_USART4EN_SHIFT))
#define RCC_APB1ENR_USART4EN_NO         (0 << (RCC_APB1ENR_USART4EN_SHIFT))
#define RCC_APB1ENR_USART4EN_YES	(1 << (RCC_APB1ENR_USART4EN_SHIFT))
#define RCC_APB1ENR_LPUART1EN_SHIFT	18
#define RCC_APB1ENR_LPUART1EN_MASK	(1 << (RCC_APB1ENR_LPUART1EN_SHIFT))
#define RCC_APB1ENR_LPUART1EN_NO	(0 << (RCC_APB1ENR_LPUART1EN_SHIFT))
#define RCC_APB1ENR_LPUART1EN_YES	(1 << (RCC_APB1ENR_LPUART1EN_SHIFT))
#define RCC_APB1ENR_USART2EN_SHIFT	17
#define RCC_APB1ENR_USART2EN_MASK	(1 << (RCC_APB1ENR_USART2EN_SHIFT))
#define RCC_APB1ENR_USART2EN_NO         (0 << (RCC_APB1ENR_USART2EN_SHIFT))
#define RCC_APB1ENR_USART2EN_YES	(1 << (RCC_APB1ENR_USART2EN_SHIFT))
#define RCC_APB1ENR_SPI2EN_SHIFT	14
#define RCC_APB1ENR_SPI2EN_MASK         (1 << (RCC_APB1ENR_SPI2EN_SHIFT))
#define RCC_APB1ENR_SPI2EN_NO		(0 << (RCC_APB1ENR_SPI2EN_SHIFT))
#define RCC_APB1ENR_SPI2EN_YES		(1 << (RCC_APB1ENR_SPI2EN_SHIFT))
#define RCC_APB1ENR_WWDGEN_SHIFT	11
#define RCC_APB1ENR_WWDGEN_MASK         (1 << (RCC_APB1ENR_WWDGEN_SHIFT))
#define RCC_APB1ENR_WWDGEN_NO		(0 << (RCC_APB1ENR_WWDGEN_SHIFT))
#define RCC_APB1ENR_WWDGEN_YES		(1 << (RCC_APB1ENR_WWDGEN_SHIFT))
#define RCC_APB1ENR_RTCAPBEN_SHIFT	10
#define RCC_APB1ENR_RTCAPBEN_MASK	(1 << (RCC_APB1ENR_RTCAPBEN_SHIFT))
#define RCC_APB1ENR_RTCAPBEN_NO         (0 << (RCC_APB1ENR_RTCAPBEN_SHIFT))
#define RCC_APB1ENR_RTCAPBEN_YES	(1 << (RCC_APB1ENR_RTCAPBEN_SHIFT))
#define RCC_APB1ENR_LEDEN_SHIFT         9
#define RCC_APB1ENR_LEDEN_MASK		(1 << (RCC_APB1ENR_LEDEN_SHIFT))
#define RCC_APB1ENR_LEDEN_NO		(0 << (RCC_APB1ENR_LEDEN_SHIFT))
#define RCC_APB1ENR_LEDEN_YES		(1 << (RCC_APB1ENR_LEDEN_SHIFT))
#define RCC_APB1ENR_TIM7EN_SHIFT	5
#define RCC_APB1ENR_TIM7EN_MASK         (1 << (RCC_APB1ENR_TIM7EN_SHIFT))
#define RCC_APB1ENR_TIM7EN_NO		(0 << (RCC_APB1ENR_TIM7EN_SHIFT))
#define RCC_APB1ENR_TIM7EN_YES		(1 << (RCC_APB1ENR_TIM7EN_SHIFT))
#define RCC_APB1ENR_TIM6EN_SHIFT	4
#define RCC_APB1ENR_TIM6EN_MASK         (1 << (RCC_APB1ENR_TIM6EN_SHIFT))
#define RCC_APB1ENR_TIM6EN_NO		(0 << (RCC_APB1ENR_TIM6EN_SHIFT))
#define RCC_APB1ENR_TIM6EN_YES		(1 << (RCC_APB1ENR_TIM6EN_SHIFT))
#define RCC_APB1ENR_TIM3EN_SHIFT	1
#define RCC_APB1ENR_TIM3EN_MASK         (1 << (RCC_APB1ENR_TIM3EN_SHIFT))
#define RCC_APB1ENR_TIM3EN_NO		(0 << (RCC_APB1ENR_TIM3EN_SHIFT))
#define RCC_APB1ENR_TIM3EN_YES		(1 << (RCC_APB1ENR_TIM3EN_SHIFT))
#define RCC_APB1ENR_TIM2EN_SHIFT	0
#define RCC_APB1ENR_TIM2EN_MASK         (1 << (RCC_APB1ENR_TIM2EN_SHIFT))
#define RCC_APB1ENR_TIM2EN_NO		(0 << (RCC_APB1ENR_TIM2EN_SHIFT))
#define RCC_APB1ENR_TIM2EN_YES		(1 << (RCC_APB1ENR_TIM2EN_SHIFT))

  __IO uint32_t         IOPSMENR;       /* 0x3c */
  __IO uint32_t         AHBSMENR;       /* 0x40 */
  __IO uint32_t         APB2SMENR;      /* 0x44 */
  __IO uint32_t         APB1SMENR;      /* 0x48 */

  __IO uint32_t         CCIPR;          /* 0x4c */
#define RCC_CCIPR_CLK48SEL_SHIFT        26
#define RCC_CCIPR_CLK48SEL_MASK         (1 << (RCC_CCIPR_CLK48SEL_SHIFT))
#define RCC_CCIPR_CLK48SEL_PLL          (0 << (RCC_CCIPR_CLK48SEL_SHIFT))
#define RCC_CCIPR_CLK48SEL_HSI48        (1 << (RCC_CCIPR_CLK48SEL_SHIFT))
#define RCC_CCIPR_LPTIM1SEL_SHIFT       18
#define RCC_CCIPR_LPTIM1SEL_MASK        (3 << (RCC_CCIPR_LPTIM1SEL_SHIFT))
#define RCC_CCIPR_LPTIM1SEL_PCLK        (0 << (RCC_CCIPR_LPTIM1SEL_SHIFT))
#define RCC_CCIPR_LPTIM1SEL_LSI         (1 << (RCC_CCIPR_LPTIM1SEL_SHIFT))
#define RCC_CCIPR_LPTIM1SEL_HSI16       (2 << (RCC_CCIPR_LPTIM1SEL_SHIFT))
#define RCC_CCIPR_LPTIM1SEL_LSE         (3 << (RCC_CCIPR_LPTIM1SEL_SHIFT))
#define RCC_CCIPR_I2C3SEL_SHIFT         16
#define RCC_CCIPR_I2C3SEL_MASK          (3 << (RCC_CCIPR_I2C3SEL_SHIFT))
#define RCC_CCIPR_I2C3SEL_PCLK          (0 << (RCC_CCIPR_I2C3SEL_SHIFT))
#define RCC_CCIPR_I2C3SEL_SYSCLK        (1 << (RCC_CCIPR_I2C3SEL_SHIFT))
#define RCC_CCIPR_I2C3SEL_HSI16         (2 << (RCC_CCIPR_I2C3SEL_SHIFT))
#define RCC_CCIPR_I2C3SEL_RESERVED3     (3 << (RCC_CCIPR_I2C3SEL_SHIFT))
#define RCC_CCIPR_I2C1SEL_SHIFT         12
#define RCC_CCIPR_I2C1SEL_MASK          (3 << (RCC_CCIPR_I2C1SEL_SHIFT))
#define RCC_CCIPR_I2C1SEL_PCLK          (0 << (RCC_CCIPR_I2C1SEL_SHIFT))
#define RCC_CCIPR_I2C1SEL_SYSCLK        (1 << (RCC_CCIPR_I2C1SEL_SHIFT))
#define RCC_CCIPR_I2C1SEL_HSI16         (2 << (RCC_CCIPR_I2C1SEL_SHIFT))
#define RCC_CCIPR_I2C1SEL_RESERVED3     (3 << (RCC_CCIPR_I2C1SEL_SHIFT))
#define RCC_CCIPR_LPUART1SEL_SHIFT      10
#define RCC_CCIPR_LPUART1SEL_MASK       (3 << (RCC_CCIPR_LPUART1SEL_SHIFT))
#define RCC_CCIPR_LPUART1SEL_PCLK       (0 << (RCC_CCIPR_LPUART1SEL_SHIFT))
#define RCC_CCIPR_LPUART1SEL_SYSCLK     (1 << (RCC_CCIPR_LPUART1SEL_SHIFT))
#define RCC_CCIPR_LPUART1SEL_HSI16      (2 << (RCC_CCIPR_LPUART1SEL_SHIFT))
#define RCC_CCIPR_LPUART1SEL_LSE        (3 << (RCC_CCIPR_LPUART1SEL_SHIFT))
#define RCC_CCIPR_USART2SEL_SHIFT       2
#define RCC_CCIPR_USART2SEL_MASK        (3 << (RCC_CCIPR_USART2SEL_SHIFT))
#define RCC_CCIPR_USART2SEL_PCLK        (0 << (RCC_CCIPR_USART2SEL_SHIFT))
#define RCC_CCIPR_USART2SEL_SYSCLK      (1 << (RCC_CCIPR_USART2SEL_SHIFT))
#define RCC_CCIPR_USART2SEL_HSI16       (2 << (RCC_CCIPR_USART2SEL_SHIFT))
#define RCC_CCIPR_USART2SEL_LSE         (3 << (RCC_CCIPR_USART2SEL_SHIFT))
#define RCC_CCIPR_USART1SEL_SHIFT       0
#define RCC_CCIPR_USART1SEL_MASK        (3 << (RCC_CCIPR_USART1SEL_SHIFT))
#define RCC_CCIPR_USART1SEL_PCLK        (0 << (RCC_CCIPR_USART1SEL_SHIFT))
#define RCC_CCIPR_USART1SEL_SYSCLK      (1 << (RCC_CCIPR_USART1SEL_SHIFT))
#define RCC_CCIPR_USART1SEL_HSI16       (2 << (RCC_CCIPR_USART1SEL_SHIFT))
#define RCC_CCIPR_USART1SEL_LSE         (3 << (RCC_CCIPR_USART1SEL_SHIFT))

  __IO uint32_t                 CSR;    /* 0x50 */
#define RCC_CSR_LPWRRSTF_SHIFT		31
#define RCC_CSR_LPWRRSTF_MASK		(1 << (RCC_CSR_LPWRRSTF_SHIFT))
#define RCC_CSR_LPWRRSTF_NO		(0 << (RCC_CSR_LPWRRSTF_SHIFT))
#define RCC_CSR_LPWRRSTF_YES		(1 << (RCC_CSR_LPWRRSTF_SHIFT))
#define RCC_CSR_WWDGRSTF_SHIFT		30
#define RCC_CSR_WWDGRSTF_MASK		(1 << (RCC_CSR_WWDGRSTF_SHIFT))
#define RCC_CSR_WWDGRSTF_NO		(0 << (RCC_CSR_WWDGRSTF_SHIFT))
#define RCC_CSR_WWDGRSTF_YES		(1 << (RCC_CSR_WWDGRSTF_SHIFT))
#define RCC_CSR_IWWGRSTF_SHIFT		29
#define RCC_CSR_IWWGRSTF_MASK		(1 << (RCC_CSR_IWWGRSTF_SHIFT))
#define RCC_CSR_IWWGRSTF_NO		(0 << (RCC_CSR_IWWGRSTF_SHIFT))
#define RCC_CSR_IWWGRSTF_YES		(1 << (RCC_CSR_IWWGRSTF_SHIFT))
#define RCC_CSR_SFTRSTF_SHIFT		28
#define RCC_CSR_SFTRSTF_MASK		(1 << (RCC_CSR_SFTRSTF_SHIFT))
#define RCC_CSR_SFTRSTF_NO		(0 << (RCC_CSR_SFTRSTF_SHIFT))
#define RCC_CSR_SFTRSTF_YES		(1 << (RCC_CSR_SFTRSTF_SHIFT))
#define RCC_CSR_PORRSTF_SHIFT		27
#define RCC_CSR_PORRSTF_MASK		(1 << (RCC_CSR_PORRSTF_SHIFT))
#define RCC_CSR_PORRSTF_NO		(0 << (RCC_CSR_PORRSTF_SHIFT))
#define RCC_CSR_PORRSTF_YES		(1 << (RCC_CSR_PORRSTF_SHIFT))
#define RCC_CSR_PINRSTF_SHIFT		26
#define RCC_CSR_PINRSTF_MASK		(1 << (RCC_CSR_PINRSTF_SHIFT))
#define RCC_CSR_PINRSTF_NO		(0 << (RCC_CSR_PINRSTF_SHIFT))
#define RCC_CSR_PINRSTF_YES		(1 << (RCC_CSR_PINRSTF_SHIFT))
#define RCC_CSR_OBLRSTF_SHIFT		25
#define RCC_CSR_OBLRSTF_MASK		(1 << (RCC_CSR_OBLRSTF_SHIFT))
#define RCC_CSR_OBLRSTF_NO		(0 << (RCC_CSR_OBLRSTF_SHIFT))
#define RCC_CSR_OBLRSTF_YES		(1 << (RCC_CSR_OBLRSTF_SHIFT))
#define RCC_CSR_FWRSTF_SHIFT		24
#define RCC_CSR_FWRSTF_MASK		(1 << (RCC_CSR_FWRSTF_SHIFT))
#define RCC_CSR_FWRSTF_NO		(0 << (RCC_CSR_FWRSTF_SHIFT))
#define RCC_CSR_FWRSTF_YES              (1 << (RCC_CSR_FWRSTF_SHIFT))
#define RCC_CSR_RMVF_SHIFT              23
#define RCC_CSR_RMVF_MASK               (1 << (RCC_CSR_RMVF_SHIFT))
#define RCC_CSR_RMVF_NO                 (0 << (RCC_CSR_RMVF_SHIFT))
#define RCC_CSR_RMVF_YES                (1 << (RCC_CSR_RMVF_SHIFT))
#define RCC_CSR_CSSLSED_SHIFT           14
#define RCC_CSR_CSSLSED_MASK            (1 << (RCC_CSR_CSSLSED_SHIFT))
#define RCC_CSR_CSSLSED_NO              (0 << (RCC_CSR_CSSLSED_SHIFT))
#define RCC_CSR_CSSLSED_YES             (1 << (RCC_CSR_CSSLSED_SHIFT))
#define RCC_CSR_CSSLSEON_SHIFT          13
#define RCC_CSR_CSSLSEON_MASK           (1 << (RCC_CSR_CSSLSEON_SHIFT))
#define RCC_CSR_CSSLSEON_NO             (0 << (RCC_CSR_CSSLSEON_SHIFT))
#define RCC_CSR_CSSLSEON_YES            (1 << (RCC_CSR_CSSLSEON_SHIFT))
#define RCC_CSR_LSEDRV_SHIFT            11
#define RCC_CSR_LSEDRV_MASK             (3 << (RCC_CSR_LSEDRV_SHIFT))
#define RCC_CSR_LSEDRV_LOWEST           (0 << (RCC_CSR_LSEDRV_SHIFT))
#define RCC_CSR_LSEDRV_MEDLOW           (1 << (RCC_CSR_LSEDRV_SHIFT))
#define RCC_CSR_LSEDRV_MEDHIGH          (2 << (RCC_CSR_LSEDRV_SHIFT))
#define RCC_CSR_LSEDRV_HIGHEST          (3 << (RCC_CSR_LSEDRV_SHIFT))
#define RCC_CSR_LSEBYP_SHIFT            10
#define RCC_CSR_LSEBYP_MASK             (1 << (RCC_CSR_LSEBYP_SHIFT))
#define RCC_CSR_LSEBYP_NO               (0 << (RCC_CSR_LSEBYP_SHIFT))
#define RCC_CSR_LSEBYP_YES              (1 << (RCC_CSR_LSEBYP_SHIFT))
#define RCC_CSR_LSERDY_SHIFT            9
#define RCC_CSR_LSERDY_MASK             (1 << (RCC_CSR_LSERDY_SHIFT))
#define RCC_CSR_LSERDY_NO               (0 << (RCC_CSR_LSERDY_SHIFT))
#define RCC_CSR_LSERDY_YES              (1 << (RCC_CSR_LSERDY_SHIFT))
#define RCC_CSR_LSEON_SHIFT             8
#define RCC_CSR_LSEON_MASK              (1 << (RCC_CSR_LSEON_SHIFT))
#define RCC_CSR_LSEON_NO                (0 << (RCC_CSR_LSEON_SHIFT))
#define RCC_CSR_LSEON_YES               (1 << (RCC_CSR_LSEON_SHIFT))
#define RCC_CSR_LSIRDY_SHIFT            1
#define RCC_CSR_LSIRDY_MASK             (1 << (RCC_CSR_LSIRDY_SHIFT))
#define RCC_CSR_LSIRDY_NO               (0 << (RCC_CSR_LSIRDY_SHIFT))
#define RCC_CSR_LSIRDY_YES              (1 << (RCC_CSR_LSIRDY_SHIFT))
#define RCC_CSR_LSION_SHIFT             0
#define RCC_CSR_LSION_MASK              (1 << (RCC_CSR_LSION_SHIFT))
#define RCC_CSR_LSION_NO                (0 << (RCC_CSR_LSION_SHIFT))
#define RCC_CSR_LSION_YES               (1 << (RCC_CSR_LSION_SHIFT))

} stm32Dev_RCC;

#endif
